abstract class Physics9{
  static var Displacement_in_rectilinear_uniform_motion = {
    'title' : 'Перемещение при прямолинейном равномерном движении.',
    'topictext':'Скорость равномерного прямолинейного движения - это постоянная векторная величина, равная отношению перемещения тела за любой промежуток времени к значению этого промежутка.',
    'formula':r"""$$\vec{u} ={{\vec{s}} \over {t}}$$""",
    'topictext_2':'Из этой формулы можно найти перемещение для прямолинейного равномерного движения.',
    'formula_2':r"""$$\vec{s} ={\vec{u}t}$$""",
    'formulaexp' : 'Где s - пройденный телом путь, u - скорость телa, t - промежуток времени, за который тело прошло данный путь.',
    'topictext_3':'Но для расчета перемещения применяют формулу, в которую входят проекции верторов на ось:',
    'formula_3':r"""$$\vec{s_x} ={\vec{u_x}t}$$""",
    'topictext_4':'При применении этой формулы нужно учитывать знаки проекций.',
    'topictext_5' : ' '
  };
  static var Rectilinear_uniformly_accelerated_motion = {
    'title' : 'Прямолинейное равноускоренное движение.Ускорение.',
    'topictext':'Ускорением тела при прямолинейном равноускоренном движении называется векторная физическая величина, равная отношению изменения скорости к промежутку времени, за который это изменение произошло.',
    'formula':r"""$$\vec{a} ={{\vec{u}-\vec{u_0}} \over {t}}$$""",
    'formulaexp':'Где a - ускорение тела, u - скорость в данный момент времени, u с индексом 0 - начальная скорость, t - промежуток времени',
    'centerlabel':'Еденицы измерения ускорения',
    'formula_2':r"""$${{1м/с}\over {1с}} = {1м/с^2}$$""",
    'topictext_2':' '
  };
  static var Body_movement_in_rectilinear_uniformly_accelerated_motion_without_initial_velocity = {
    'title' : 'Перемещение тела при ПРД без начальной скорости.',
    'topictext':'Рассмотрим, как рассчитывается проекция вектора перемещения тела, движущегося равноускоренно, если его скорость равна нулю. В этом случае уравнение',
    'formula':r"""$${s_x} = {{u_{0x}}t + {{{a_x}{t^2}}\over {2}}}$$""",
    'topictext_2':'Будет выглядеть так:',
    'formula_2':r"""$${s_x}= {{{a_x}{t^2}}\over {2}}$$""",
    'formulaexp':'Где s - перемещение, a - ускорение, t - время.',
    'topictext_3':'Мы нашли формулу для вычисления перемещения при прямолинейном равноускоренном движении с нулевой начальной скоростью.',
    'topictext_4':' '
  };
 static var hesitation = {
   'title' : 'Колебания',
   'topictext':'',
   'formula':r"""$$$$""",
   'formulaexp':'',
 },
}